"""تاپل ها ایمیوتیبل هستند و فقط خواندنی و پس از ساخته شدن تغییر نمی کنن"""
"""برای تغییر باید تبدیلش کنم به لیست ، تغییرش بدم و دوباره تبدیلش کنم به تاپل"""
"""بعد از ساخته شدن تاپل ها ترتیبشون هم تغییر نمیکنن"""
"""تاپل ها  بیشتر برای گزارش ها استفاده میشوند و معمولا کمتر در محاسبات کاربرد دارند"""
"""درستش اینکه اگر مجموعه داریم که تغییر نمیکنه به صورت تاپل تعریف کن چون سریع از لیست هستش و منبع کمتری مصرف میکنه"""
'''در تعریف تاپل ها اگر یک دیتا درون آن باشددیگر تاپل نیست و هم جنس دیتا ورودی میشود'''
tuple1 = (1)
print(type(tuple1))
#return => int

##index
tuple2 = (1,2,3,4,5)
print(tuple2[1])

'''تاپل ها رو میشه بدون پرانتز تعریف کرد اما نشانه تاپل بودن کاما هستش. البته بهتره پرانتز هم بذاریم تا کد تمیز تر باشه'''


##sum
tuple3 = (1,2,3,4,5)
tuple4 = (6,7,8,9,10)
print(tuple3 + tuple4)
#Return : (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

##or
print(type(tuple3 + (6,7)))

#error print(type(tuple3 + (6)))

#ضرب در عدد
""" در صورت اینکه یک تاپل رو در عددی ضرب کنیم به اون تعداد عدد تاپل تکرار میشود"""
tuple9 = (1,2,3,4,5)
print(tuple9 * 2)
#=>(1, 2, 3, 4, 5, 1, 2, 3, 4, 5)




#assinment
"""انتقال دیتا تاپل ها به متغییر ها"""
tuple5 = (1,2,3,4,5)
(a,b,c,d,e) = tuple5
##error (a,b,c) = tuple5
print(a) #=>1
print(b) #=>2


tuple6 = (3,5,6,53,7)
(a1,*b1,c1) = tuple6
print(a1) #=> 3
print(b1) #=> [5,6,53]
print(c1) #=> 7


tuple6 = (3,5,6,53,7)
(a2,*b2,c2,d2) = tuple6
print(a2) #=> 3
print(b2) #=> [5,6]
print(c2) #=> 53
print(d2) #=> 7


"""ستاره در پایتون علاوه بر ضرب معنا هر چند تا هم میده"""



####Method

#index()
"""شماره ایندکس مقدار مد نظر را برمیگرداند"""
tuple7 = (1,1404,53,14,5)
print(tuple7.index(1404)) #return => 1

#count()
"""تعداد تکرار اون مقدار ورودی در اون تاپل رو نشون میشه"""
tuple8 = (5,5,36,3,2,1,6,4,5)
print(tuple8.count(5)) #=> 3




###Maximum
tuple9 = (1,2,3,4,5,7,8,9,10)
maxx = -999999
index = 0
x = 0
for i in tuple9:
    if i > maxx:
        maxx = i
        index = x
    x = x + 1
print(maxx)


